<?php

/**
 * 订单配置文件
 *
 * @author Vincent <nyewon@gmail.com>
 */
return [
    'status' => [
        0 => '未处理',
        1 => '准备发货',
        2 => '需补货',
        3 => '打包完成',
        4 => '发货完成',
        5 => '订单完成',
        6 => '取消订单',

    ],
    'active' => [
        0 => '正常',
        1 => '退换货',
        2 => '物流问题',
        3 => '需退款',
        4 => 'accounting',
        5 => 'chargeback',
        6 => '暂停发货',
    ],

    'item' => [
        'status' => [
            0 => '已删除',
            1 => '正常'
        ]
    ],

    'package' => [
        'status' => [
            0 => '未处理',
            1 => '开始处理',
            2 => '配货中',
            3 => '打包中',
            5 => '已发货',
            6 => '妥投',
            7 => '到达待取',
            4 => '取消',
        ],
    ]
];

