<?php

/**
 * 系统常用配置文件
 *
 * @author Vincent <nyewon@gmail.com>
 */
return [
    /**
     * CRM对接ERP时间，用于存在orders表区别新旧数据
     */
    'erpData' => "2016-09-05 18:05:00",
    /**
     * 默认分页条数
     */
    'pageSize' => 10,
    /**
     * 可选分页条数
     */
    'pageSizes' => [10, 25, 50, 100],
    /**
     * 默认排序字段
     */
    'orderField' => 'id',
    /**
     * 默认排列顺序
     */
    'orderDirection' => 'desc',
    /**
     * 默认标题
     */
    'titles' => [
        'index' => '列表',
        'show' => '详情',
        'create' => '新增',
        'edit' => '编辑',
    ],

    //投诉类型
    'complaints' =>[
        'normal'=>[
            '1'=>'正常',
        ],
        'logistics'=>[
            '1'=>'采购慢',
            '2'=>'物流慢',
            '3'=>'到货损坏',
            '4'=>'包裹被物流退回',
            '5'=>'海关关税',
            '6'=>'偏远地区附加费',
        ],
        'sendwrong'=>[
            '1'=>'漏发',
            '2'=>'发错尺码',
            '3'=>'发错Model',
            '4'=>'袋衣不符',
            '5'=>'发错地址',
        ],
        'quality'=>[
            '1'=>'不符预期',
            '2'=>'版型不好',
            '3'=>'印染问题',
            '4'=>'面料破损',
            '5'=>'面料轻薄',
            '6'=>'掉色',
            '7'=>'掉毛',
            '8'=>'污渍',
            '9'=>'剪裁缝线',
            '10'=>'拉链破损',
            '11'=>'味道刺鼻',
            '12'=>'扣眼未剪',
            '13'=>'勾丝问题',
            '14'=>'皱皱巴巴',
            '15'=>'鞋内有钉',
        ],
        'sizewrong'=>[
            '1'=>'尺码偏大',
            '2'=>'尺码偏小',
            '3'=>'尺码不合适',
        ],
        'picturewrong'=>[
            '1'=>'尺码不符',
            '2'=>'图案和描述不符',
            '3'=>'颜色和描述不符',
            '4'=>'细节不符',
            '5'=>'材质不符',
        ],
        'other'=>[
            '1'=>'不想要了',
        ],
    ],


    //解决方案
    'settled'=>[
        '退回'=>'退回',
        '折扣券'=>'折扣券',
        '积分'=>'积分',
        '部分退款'=>'部分退款',
        '全额退款'=>'全额退款',
    ],

    'transfer_search' => [
        'from_name' => '用户昵称',
        'from' => '客户ID',
        'label' => '标签',
        'status' => '消息状态',
        'assign_id' => '客服',
        'created_at' => '创建时间',
        'get_time' => '创建时间',
        'channel_id' => '渠道',
        'account_id' => '账号',
        'message_template_types.parent_id' => '上级类型',
        'type_id' => '一级类型',
        'account' => '账号',
        'name' => '名称',
        'channel_id' => '渠道',

    ],


];

